/**
 * Created by Taly on 21.12.2016.
 * Напишите цикл for, в котором перебирались бы значения от 1000 до 0 с шагом -2
 */
public class HomeWork_3_4 {
    public static void main(String[] args) {

        for (int i = 1000; i >= 0 ; i-=2) {
            System.out.println(i);
        }
    }
}
