/**
 * Created by Taly on 13.12.2016.
 * Домашнее задание 2.5
 * Вывести слова на разных строках
 */
public class Tab {
    public static void main(String[] args) {
        System.out.println("Один\nДва\nТри");
    }
}
